---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkIterator.GetOtherAnalyticalNode
source: html/7124c822-5a6b-eb5d-3db0-20ff041f39e5.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkIterator.GetOtherAnalyticalNode Method

Gets the other analytical node at the current iteration step.

## Syntax (C#)
```csharp
public MEPAnalyticalNode GetOtherAnalyticalNode()
```

## Returns
The retrieved analytical node, null if the current iteration step does not have additional analytical node.